using System;

namespace _04.ChislaVKoloni
{
    class Program
    {
        static void Main(string[] args)
        {
            /*Напишете програма, която отпечатва три числа в три виртуални колони на конзолата. 
             * Всяка колона трябва да е с широчина 10 символа, а числата трябва да са ляво подравнени. 
             * Първото число трябва да е цяло число в шестнадесетична бройна система, второто да е дробно положи-телно, 
             * а третото да е дробно отрицателно. Последните две числа да се закръглят до втория знак след десетичната запетая.*/

            int num1 = 0xf59a;
            double num2 = 3547.2665;
            double num3 = -4599.644;

            Console.WriteLine("{0}     |          |          ", num1);
            Console.WriteLine("{0} |          |          ", num2);
            Console.WriteLine("{0} |          |          ", num3);


        }
    }
}
